SunCity/src/DataProcessors/МониторДиректораМагазина/МониторДиректораМагазина.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МониторДиректораМагазина</name>
</mdclass:DataProcessor>

SunCity/src/Enums/ВидыАнализаМонитора/ВидыАнализаМонитора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыАнализаМонитора</name>
  <enumValues>
    <name>КоличествоЧеков</name>
  </enumValues>
  <enumValues>
    <name>СреднийЧек</name>
  </enumValues>
  <enumValues>
    <name>СуммаПродаж</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиДС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиДСККМ</name>
  </enumValues>
  <enumValues>
    <name>ДвиженияДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажиПоКонтрагентам</name>
  </enumValues>
  <enumValues>
    <name>ЗадолженностьПоставщикам</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВидыДиаграмм/ВидыДиаграмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДиаграмм</name>
  <enumValues>
    <name>График</name>
  </enumValues>
  <enumValues>
    <name>ГрафикПоШагам</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСНакоплением</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластями</name>
  </enumValues>
  <enumValues>
    <name>ГрафикСОбластямиИНакоплением</name>
  </enumValues>
  <enumValues>
    <name>Гистограмма</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаСНакоплением</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаОбъемная</name>
  </enumValues>
  <enumValues>
    <name>ГистограммаГоризонтальная</name>
  </enumValues>
  <enumValues>
    <name>Круговая</name>
  </enumValues>
  <enumValues>
    <name>КруговаяОбъемная</name>
  </enumValues>
  <enumValues>
    <name>Измерительная</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <comment>Порядок округления суммы чека в пользу покупателя</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортиментВЗаказеПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаПотребности</name>
    <type>
      <types>EnumRef.МетодыРасчетаПотребности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОкругленияЧекаВПользуПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьТорговогоЗала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеТолькоПриОплатеНаличными</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/DataProcessors/МониторДиректораМагазина/Forms/РабочийСтолДиректора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьПлитки();
	ИнициализироватьДанныеФормы();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ИзменитьИнтерфейсФормы();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗапуститьОбновлениеПоказателей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПлитка1ЗаголовокПоказателяНажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	
	Отбор = Новый Структура("Период", Период);
	
	ПараметрыОтчета.Вставить("Отбор", Отбор);
	ПараметрыОтчета.Вставить("КлючВарианта", "ВыручкаПоДням");
	
	ОткрытьФорму("Отчет.Выручка.Форма",ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлитка2ЗаголовокПоказателяНажатие(Элемент)
	
	ОткрытьРасшифровкуПоказателя_ДанныеПоЧекам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлитка3ЗаголовокПоказателяНажатие(Элемент)
	
	ОткрытьРасшифровкуПоказателя_ДанныеПоЧекам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлитка4ЗаголовокПоказателяНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляОтображения", ПолучитьПараметрыПоказателя_ДенежныеСредства());
	
	ОткрытьФорму("Отчет.МониторПоказателей.Форма.ФормаОтчета",  ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлитка5ЗаголовокПоказателяНажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ДатаОтчета = Новый СтандартнаяДатаНачала;
	ДатаОтчета.Вариант = ВариантСтандартнойДатыНачала.НачалоЭтогоДня;
	
	Отбор = Новый Структура("ДатаОтчета", ДатаОтчета);
	
	ПараметрыОтчета.Вставить("Отбор", Отбор);
	ПараметрыОтчета.Вставить("КлючВарианта", "СтоимостнаяОценкаСкладаВРозничныхЦенах");
	
	ОткрытьФорму("Отчет.СтоимостнаяОценкаСклада.Форма",ПараметрыОтчета);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлитка6ЗаголовокПоказателяНажатие(Элемент)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	Период = Новый СтандартныйПериод;
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
	
	Отбор = Новый Структура("Период", Период);
	
	ПараметрыОтчета.Вставить("Отбор", Отбор);
	ПараметрыОтчета.Вставить("КлючВарианта", "ПланОплатыПоставок");
	
	ОткрытьФорму("Отчет.ПланОплатыПоставок.Форма",ПараметрыОтчета);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗапуститьОбновлениеПоказателей();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

&НаСервере
Процедура ИнициализироватьПлитки()
	
	Элементы.ДекорацияПлитка1ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Выручка за 7 дней'");
	
	Элементы.ДекорацияПлитка2ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Чеков продажи'");
	
	Элементы.ДекорацияПлитка3ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Средний чек'");
	
	Элементы.ДекорацияПлитка4ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Остаток денежных средств'");
	
	Элементы.ДекорацияПлитка5ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Товарный остаток'");
	
	Элементы.ДекорацияПлитка6ЗаголовокПоказателя.Заголовок = НСтр("ru = 'Платежи поставщикам'");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	ЗаполнитьСписокДоступныхМагазинов();
	ЗаполнитьПоказателиДляРасшифровки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхМагазинов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Магазины.Ссылка КАК Магазин
	|ИЗ
	|	Справочник.Магазины КАК Магазины
	|ГДЕ
	|	НЕ Магазины.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Магазины.Наименование";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокМагазинов.Добавить(Выборка.Магазин);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоказателиДляРасшифровки()
	
	НовыйПоказатель = ПоказателиДляРасшифровки.Добавить();
	НовыйПоказатель.Доступность 	= Истина;
	НовыйПоказатель.Показатель 		= Перечисления.ВидыАнализаМонитора.КоличествоЧеков;
	НовыйПоказатель.ВидОтображения 	= Перечисления.ВидыДиаграмм.ГистограммаСНакоплением;
	НовыйПоказатель.ПалитраЦветов	= ПалитраЦветовДиаграммы.Мягкая;
	НовыйПоказатель.ЛинияТренда		= Ложь;
	
	НовыйПоказатель = ПоказателиДляРасшифровки.Добавить();
	НовыйПоказатель.Доступность 	= Истина;
	НовыйПоказатель.Показатель 		= Перечисления.ВидыАнализаМонитора.СреднийЧек;
	НовыйПоказатель.ВидОтображения 	= Перечисления.ВидыДиаграмм.ГистограммаСНакоплением;
	НовыйПоказатель.ПалитраЦветов	= ПалитраЦветовДиаграммы.Мягкая;
	НовыйПоказатель.ЛинияТренда		= Ложь;
	
	НовыйПоказатель = ПоказателиДляРасшифровки.Добавить();
	НовыйПоказатель.Доступность 	= Истина;
	НовыйПоказатель.Показатель 		= Перечисления.ВидыАнализаМонитора.ОстаткиДС;
	НовыйПоказатель.ВидОтображения 	= Перечисления.ВидыДиаграмм.Круговая;
	НовыйПоказатель.ПалитраЦветов	= ПалитраЦветовДиаграммы.Теплая;
	НовыйПоказатель.ЛинияТренда		= Ложь;
	
	НовыйПоказатель = ПоказателиДляРасшифровки.Добавить();
	НовыйПоказатель.Доступность 	= Истина;
	НовыйПоказатель.Показатель 		= Перечисления.ВидыАнализаМонитора.ОстаткиДСККМ;
	НовыйПоказатель.ВидОтображения 	= Перечисления.ВидыДиаграмм.Круговая;
	НовыйПоказатель.ПалитраЦветов	= ПалитраЦветовДиаграммы.Теплая;
	НовыйПоказатель.ЛинияТренда		= Ложь;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеПоказателей

&НаКлиенте
Процедура ЗапуститьОбновлениеПоказателей()
	
	ДлительнаяОперация = ЗапуститьОбновлениеПоказателейСервер(УникальныйИдентификатор);
	
	АдресХранилища = ДлительнаяОперация.АдресРезультата;
	ИдентификаторЗадания = ДлительнаяОперация.ИдентификаторЗадания;
	
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		Элементы.СтраницыГлавные.ТекущаяСтраница = Элементы.СтраницаПоказателиОбновляются;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеПоказателейЗавершение", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ОтобразитьЗначенияПоказателей();
		
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДлительнаяОперация.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеПоказателейСервер(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0.1;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДиаграммаВыручка", ДиаграммаВыручка);
	ПараметрыРасчета.Вставить("ДоступныеМагазины", СписокМагазинов.ВыгрузитьЗначения());
	ПараметрыРасчета.Вставить("ПоказателиДляРасшифровки", ПоказателиДляРасшифровки.Выгрузить());
	
	РезультатФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторДиректораМагазина.РассчитатьЗначенияПоказателейВФоне",
		ПараметрыРасчета,
		ПараметрыВыполнения);
	
	Возврат РезультатФоновогоЗадания;
КонецФункции

&НаКлиенте
Процедура ОбновлениеПоказателейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		АдресХранилища = Результат.АдресРезультата;
		ОтобразитьЗначенияПоказателей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЗначенияПоказателей()
	
	ЗначенияПоказателей = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(ЗначенияПоказателей) = Тип("Структура") Тогда
		
		Элементы.СтраницыГлавные.ТекущаяСтраница = Элементы.СтраницаПоказатели;
		
		Выручка = ЗначенияПоказателей.Выручка;
		Если Выручка.ВыполнениеПоказателя < 0 Тогда
			Выручка.ВыполнениеПоказателя = Выручка.ВыполнениеПоказателя * (-1);
			Элементы.ДекорацияИзменениеПоказателя.Картинка = БиблиотекаКартинок.СтрелкаВнизБольшая;
		Иначе
			Элементы.ДекорацияИзменениеПоказателя.Картинка = БиблиотекаКартинок.СтрелкаВверхБольшая;
		КонецЕсли;
		
		Показатель1ВыполнениеПоказателя = ПоказательСтрокой(Выручка.ВыполнениеПоказателя, "%");
		Показатель1ТекущийПериод = ПоказательСтрокой(Выручка.ВыручкаТекущая);
		ДиаграммаВыручка = Выручка.ДиаграммаВыручка;
		
		ДанныеПоЧекам = ЗначенияПоказателей.ДанныеПоЧекам;
		Показатель2 = ПоказательСтрокой(ДанныеПоЧекам.КоличествоЧеков, "");
		Показатель3 = ПоказательСтрокой(ДанныеПоЧекам.СреднийЧек);
		
		Показатель4 = ПоказательСтрокой(ЗначенияПоказателей.ДенежныеСредства);
		Показатель5 = ПоказательСтрокой(ЗначенияПоказателей.ТоварныйОстаток);
		
		ПлатежиПоставщикам = ЗначенияПоказателей.ПлатежиПоставщикам;
		
		ШаблонЗначения = "Показатель6_%1Значение";
		ШаблонИмени = "Показатель6_%1Имя";
		
		ТекПоказательПлитки = 1;
		Для Каждого ЗначениеПоказателя Из ПлатежиПоставщикам Цикл
			Значение = Окр(ЗначениеПоказателя.Значение,0);
			
			ЭтотОбъект[СтрШаблон(ШаблонИмени, ТекПоказательПлитки)] = ЗначениеПоказателя.ИмяЗначения;
			ЭтотОбъект[СтрШаблон(ШаблонЗначения, ТекПоказательПлитки)] = 
			ПоказательСтрокой(Значение);
			ТекПоказательПлитки = ТекПоказательПлитки + 1;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьРасшифровкуПоказателя_ДанныеПоЧекам()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляОтображения", ПолучитьПараметрыПоказателя_ДанныеПоЧекам());
	
	ОткрытьФорму("Отчет.МониторПоказателей.Форма.ФормаОтчета",  ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПоказателя_ДанныеПоЧекам()
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДоступныеМагазины", СписокМагазинов.ВыгрузитьЗначения());
	ПараметрыРасчета.Вставить("ПоказателиДляРасшифровки", ПоказателиДляРасшифровки.Выгрузить());
	
	Возврат Обработки.МониторДиректораМагазина.ПолучитьПараметрыПоказателя_ДанныеПоЧекам(ПараметрыРасчета);

КонецФункции

&НаСервере
Функция ПолучитьПараметрыПоказателя_ДенежныеСредства()
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДоступныеМагазины", СписокМагазинов.ВыгрузитьЗначения());
	ПараметрыРасчета.Вставить("ПоказателиДляРасшифровки", ПоказателиДляРасшифровки.Выгрузить());
	
	Возврат Обработки.МониторДиректораМагазина.ПолучитьПараметрыПоказателя_ДенежныеСредства(ПараметрыРасчета);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоказательСтрокой(Знач Показатель, ПоказательСуффикс = Неопределено)
	
	Если ПоказательСуффикс = Неопределено Тогда
		Суффикс = " ₽";
	ИначеЕсли ЗначениеЗаполнено(ПоказательСуффикс) Тогда
		Суффикс = " " + ПоказательСуффикс;
	Иначе
		Суффикс = "";
	КонецЕсли;
	
	ПоказательСтрокой = Формат(Показатель, "ЧДЦ=0; ЧН=0; ЧФ=Ч") + Суффикс;
	
	Возврат ПоказательСтрокой;
КонецФункции

&НаСервере
Процедура ИзменитьИнтерфейсФормы()
	
	Элементы.ДекорацияПлитка6ЗаголовокПоказателяОтступ.Видимость = Ложь;
	ШрифтЭлементов = Новый Шрифт(, 17, Истина, , , );
	Элементы.Показатель6_1Значение.Шрифт = ШрифтЭлементов;
	Элементы.Показатель6_2Значение.Шрифт = ШрифтЭлементов;
	Элементы.Показатель6_3Значение.Шрифт = ШрифтЭлементов;
	Элементы.Показатель5.Шрифт = ШрифтЭлементов;
	Элементы.Показатель4.Шрифт = ШрифтЭлементов;
	Элементы.Показатель3.Шрифт = ШрифтЭлементов;
	Элементы.Показатель2.Шрифт = ШрифтЭлементов;
	Элементы.Показатель1ВыполнениеПоказателя.Шрифт = ШрифтЭлементов;
	
КонецПроцедуры
#КонецОбласти
